Tekla.Structures.Drawing.GridLine.GridLabel
The GridLabel class contains the grid labels of the grid lines, the text label and the insertion points.

Tekla.Structures.Drawing.GridLine.GridLabel.CenterPoint
The center point of the grid label.

Tekla.Structures.Drawing.GridLine.GridLabel.FrameWidth
The width of the grid label frame.

Tekla.Structures.Drawing.GridLine.GridLabel.FrameHeight
The height of the grid label frame.

Tekla.Structures.Drawing.GridLine.GridLabel.TextWidth
The width of the grid label's text frame.

Tekla.Structures.Drawing.GridLine.GridLabel.TextHeight
The height of the grid label's text frame.

Tekla.Structures.Drawing.GridLine.GridLabel.GridPoint
The grid line point, without offsets taken into consideration (model grid line coordinates).

Tekla.Structures.Drawing.GridLine.GridLabel.OffsetGridPoint
The grid line point where the grid line actually ends, with offsets applied.

Tekla.Structures.Drawing.GridLine.GridLabel.GridLabelPoint
The grid line's label point.
If the value of GridLabelPoint differs from the OffsetGridPoint value,
a leader line will be created to the GridLabelPoint position.
You can remove the leader line by setting GridLabelPoint to the GridPoint value
(or by setting the GridLabelPoint anywhere on the grid line, but then the offset will change).

Tekla.Structures.Drawing.GridLine.GridLabel.GridLabelText
The grid line's label text.

Tekla.Structures.Drawing.GridLine.GridLabel.GetAxisAlignedBoundingBox
The bounding box of the grid line label (rectangle format, axis aligned).
Returns: The bounding box of the grid line label.

Tekla.Structures.Drawing.GridLine.GridLabel.GetAxisAlignedBoundingBoxOfTextLabel
The bounding box of the grid line label's text (rectangle format, axis aligned).
Returns: The bounding box of the grid line label's text.

Tekla.Structures.Drawing.GridLine.GridLabel.MoveObjectRelative(Tekla.Structures.Geometry3d.Vector)
Moves the object using the move vector.
MoveVector: The move vector to be used.
Returns: True.

Tekla.Structures.Drawing.GridLine.GridLabel.#ctor
Creates a new default grid label instance.